//Какое будет выведено значение: 5
let x = 5; 
alert( x++ );

//Чему равно такое выражение: [ ] + false - null + true = Nan

//Что выведет этот код: let y = 1; let x = y = 2; alert(x); ?
//=Ошибку так как x уже назначен

//Чему равна сумма [ ] + 1 + 2 = 12

//Что выведет этот код: alert( "1"[0] ) = 1

//Чему равно 2 && 1 && null && 0 && undefined = null

//Есть ли разница между выражениями? !!( a && b ) и (a && b) = да

//Что выведет этот код: alert( null || 2 && 3 || 4 ) = 3

//a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ?

//Что выведет этот код: alert( +"Infinity" ); ?

//Верно ли сравнение: "ёжик" > "яблоко"?

//Чему равно 0 || "" || 2 || undefined || true || falsе ?
